##   Pandas Library in Python
- **Pandas Library** is a very important library containing diferent algorithms and function already written and is used when we have to work on data, different type of analyses and also data manipulation.
- it was started developing in 2008 and then in 2009 it became open-source and in 2012 first addition of Pthon for data analysis was published and the in 2015 it was sponsored by NumFOCUS and finally in 2018 first in-persone core developer sprint.

###   Why PANDAS?
- **Data Manipulation**: is the process of manipulating data in such a way that certain changes makes it organized and easier to read and understand.
    - **Purpose**: 
        - Consistent Data
        - Project related data extraction
        - Create more value from data 
        - Remove or ignore unnecessary data
        - Image Scrapping(Getting data from Images)
- **Data Analysis**: is basically using data to do something productive for example:
    - Virtual part of a business
    - Learn and Adapt
    - Data driven decisions making
    - Data driven policy making
    - How many likes and responses
    - Should I continue soem program?
    - How international we are?
    - How good is some model?
    - Should we ban diesel cars? or import more gas cars?
    - Percent of people in something or in relevancy
    - Engineering work performances...etc
###   Types of Data Analysis
- 1. Descriptive analytics: What happened?
- 2. Diagnostic analytics:Why did it happen?
- 3. Predictive analytics: What is likely to happen in future?
- 4. Prescriptive analytics: What is the best course of action to take?

###   PANDAS vs MS Excel
|**Pandas**|**MS Excel**|
---|---|
|Data Frame|Worksheet|
|Series|Columns|
|Index|Row Headings|
|Row|Row|
|NaN|Empty Cell|

##   PANDAS Uses
- Python Library
- Data Analysis
- Data Manipulation
- Data Science
- Machine Learning(ML)
- If your work involves Data you must use it
- Load, read, prepare, model and analyze data
- Join, merge, filter, reshape
- Data from different databases and join in one
- Anything with Data
- Dataframes = Panadas Data Structure
- Kashti data = Downloaded and saved in excel

##   Working with PANDAS
###  Installing and importing PANDAS Library

In [1]:
#installing pandas
# pip install pandas
#importing PAndas Library
import pandas as pd
import numpy as np

In [2]:
# Object creation
s= pd.Series([1,3,4,5,6,7])
# adding empty value
# s= pd.Series([1,3,4,np.nan,5,6,7])
s

0    1
1    3
2    4
3    5
4    6
5    7
dtype: int64

In [3]:
#adding Dates

dates = pd.date_range("20130101", periods= 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
#Making Data Frames from pandas
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.744068  0.707651 -1.499833 -0.065783
2013-01-02  0.056498  2.667955 -1.575088  0.905107
2013-01-03 -0.861906  2.361573  0.461547  2.285360
2013-01-04 -0.261028 -0.272507  2.476634 -1.180546
2013-01-05 -0.645866  1.099849 -0.116315 -1.513242
2013-01-06 -0.024248 -1.243800  1.396448 -1.261956

In [5]:
#Making Dataframe in dictionaries
df2= pd.DataFrame(
    {
        "A" : 1.0,
        "B":pd.Timestamp("20220111"),
        "C":pd.Series(1, index = list(range(4)), dtype="float32"),
        "D":np.array([3]* 4, dtype="int32"),
        "E":pd.Categorical(["girl","woman","girl","woman"]),
        "F": "females",
    }
)
df2

     A          B    C  D      E        F
0  1.0 2022-01-11  1.0  3   girl  females
1  1.0 2022-01-11  1.0  3  woman  females
2  1.0 2022-01-11  1.0  3   girl  females
3  1.0 2022-01-11  1.0  3  woman  females

In [6]:
#Data types of dictionary
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
# getting head of data
df2.head()

     A          B    C  D      E        F
0  1.0 2022-01-11  1.0  3   girl  females
1  1.0 2022-01-11  1.0  3  woman  females
2  1.0 2022-01-11  1.0  3   girl  females
3  1.0 2022-01-11  1.0  3  woman  females

In [8]:
# getting lower data area or tail of data(last 2lines)
df.tail(2)

                   A         B         C         D
2013-01-05 -0.645866  1.099849 -0.116315 -1.513242
2013-01-06 -0.024248 -1.243800  1.396448 -1.261956

In [9]:
# Getting index of data
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [10]:
#viewing Data from already data available
# a = pd.read_csv("file directory or link")
# a

In [11]:
# converting data to numpy
df.to_numpy()

array([[ 0.74406768,  0.70765133, -1.49983309, -0.06578282],
       [ 0.05649806,  2.66795486, -1.57508844,  0.90510722],
       [-0.86190555,  2.36157301,  0.46154715,  2.28536013],
       [-0.26102754, -0.27250656,  2.4766341 , -1.18054647],
       [-0.64586648,  1.0998494 , -0.11631474, -1.51324173],
       [-0.02424752, -1.24379958,  1.39644811, -1.26195633]])

In [12]:
# making dict data type to nummpy
df.to_numpy()

array([[ 0.74406768,  0.70765133, -1.49983309, -0.06578282],
       [ 0.05649806,  2.66795486, -1.57508844,  0.90510722],
       [-0.86190555,  2.36157301,  0.46154715,  2.28536013],
       [-0.26102754, -0.27250656,  2.4766341 , -1.18054647],
       [-0.64586648,  1.0998494 , -0.11631474, -1.51324173],
       [-0.02424752, -1.24379958,  1.39644811, -1.26195633]])

In [13]:
#mean #count #std #25% #50%, #75%,#max,# #min
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.165414  0.886787  0.190566 -0.138510
std    0.569457  1.503888  1.601428  1.497159
min   -0.861906 -1.243800 -1.575088 -1.513242
25%   -0.549657 -0.027467 -1.153954 -1.241604
50%   -0.142638  0.903750  0.172616 -0.623165
75%    0.036312  2.046142  1.162723  0.662385
max    0.744068  2.667955  2.476634  2.285360

In [14]:
# Converting Rows to column and column to rows(Transpose)
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2022-01-11 00:00:00,2022-01-11 00:00:00,2022-01-11 00:00:00,2022-01-11 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,girl,woman,girl,woman
F,females,females,females,females

In [15]:
# sorting data descending order 
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.065783 -1.499833  0.707651  0.744068
2013-01-02  0.905107 -1.575088  2.667955  0.056498
2013-01-03  2.285360  0.461547  2.361573 -0.861906
2013-01-04 -1.180546  2.476634 -0.272507 -0.261028
2013-01-05 -1.513242 -0.116315  1.099849 -0.645866
2013-01-06 -1.261956  1.396448 -1.243800 -0.024248

In [16]:
# sorting data ascending order 
df.sort_index(axis=1, ascending=True)
# Sorting by column B and ascending
df.sort_values(by="B", ascending = True)

                   A         B         C         D
2013-01-06 -0.024248 -1.243800  1.396448 -1.261956
2013-01-04 -0.261028 -0.272507  2.476634 -1.180546
2013-01-01  0.744068  0.707651 -1.499833 -0.065783
2013-01-05 -0.645866  1.099849 -0.116315 -1.513242
2013-01-03 -0.861906  2.361573  0.461547  2.285360
2013-01-02  0.056498  2.667955 -1.575088  0.905107

In [17]:
#selection data from column A
df["A"]

2013-01-01    0.744068
2013-01-02    0.056498
2013-01-03   -0.861906
2013-01-04   -0.261028
2013-01-05   -0.645866
2013-01-06   -0.024248
Freq: D, Name: A, dtype: float64

In [18]:
#selecting rows by number
df[2:5]

                   A         B         C         D
2013-01-03 -0.861906  2.361573  0.461547  2.285360
2013-01-04 -0.261028 -0.272507  2.476634 -1.180546
2013-01-05 -0.645866  1.099849 -0.116315 -1.513242

In [19]:
# Select by labels i.e. dates wise in this case
df.loc[dates[0]]

A    0.744068
B    0.707651
C   -1.499833
D   -0.065783
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
#using multiple axis labels
# df.loc[:(Setting rows),["A","B"](Setting labels)]
df.loc[:,["A","B"]]

                   A         B
2013-01-01  0.744068  0.707651
2013-01-02  0.056498  2.667955
2013-01-03 -0.861906  2.361573
2013-01-04 -0.261028 -0.272507
2013-01-05 -0.645866  1.099849
2013-01-06 -0.024248 -1.243800

In [21]:
#getting data by rows and labels setting
df.loc["20130101":"20130104", ["A","B","C"]]

                   A         B         C
2013-01-01  0.744068  0.707651 -1.499833
2013-01-02  0.056498  2.667955 -1.575088
2013-01-03 -0.861906  2.361573  0.461547
2013-01-04 -0.261028 -0.272507  2.476634

In [22]:
#getting data by rows and labels setting with specified dimensions

df.loc["20130101", ["A","B","C"]]

A    0.744068
B    0.707651
C   -1.499833
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
# getting Specified cell data 
df.at[dates[4],"A"]

-0.6458664841686863

In [24]:
# GEtting data based on position
df.iloc[2]

A   -0.861906
B    2.361573
C    0.461547
D    2.285360
Name: 2013-01-03 00:00:00, dtype: float64

In [25]:
#getting specified data from columns
df.iloc[:, 0:2]

                   A         B
2013-01-01  0.744068  0.707651
2013-01-02  0.056498  2.667955
2013-01-03 -0.861906  2.361573
2013-01-04 -0.261028 -0.272507
2013-01-05 -0.645866  1.099849
2013-01-06 -0.024248 -1.243800

In [26]:
#Getting Values greater than something, or filtering special
df[df["B"] > 0]

                   A         B         C         D
2013-01-01  0.744068  0.707651 -1.499833 -0.065783
2013-01-02  0.056498  2.667955 -1.575088  0.905107
2013-01-03 -0.861906  2.361573  0.461547  2.285360
2013-01-05 -0.645866  1.099849 -0.116315 -1.513242

In [27]:
#copying data
df3 = df.copy()

In [28]:
#Concatenating a column but remeber to add all values in column cells
df3["E"]  = ["one","one", "One", "Three","One", "Three"]
df3

                   A         B         C         D      E
2013-01-01  0.744068  0.707651 -1.499833 -0.065783    one
2013-01-02  0.056498  2.667955 -1.575088  0.905107    one
2013-01-03 -0.861906  2.361573  0.461547  2.285360    One
2013-01-04 -0.261028 -0.272507  2.476634 -1.180546  Three
2013-01-05 -0.645866  1.099849 -0.116315 -1.513242    One
2013-01-06 -0.024248 -1.243800  1.396448 -1.261956  Three

In [29]:
#adding another column with defined perimeters
df3["mean"] = df["B"] > 1.2
df3

                   A         B         C         D      E   mean
2013-01-01  0.744068  0.707651 -1.499833 -0.065783    one  False
2013-01-02  0.056498  2.667955 -1.575088  0.905107    one   True
2013-01-03 -0.861906  2.361573  0.461547  2.285360    One   True
2013-01-04 -0.261028 -0.272507  2.476634 -1.180546  Three  False
2013-01-05 -0.645866  1.099849 -0.116315 -1.513242    One  False
2013-01-06 -0.024248 -1.243800  1.396448 -1.261956  Three  False

In [30]:
# selecting specific column to keep and removing extra columns
df3= df3.iloc[:, 0:4]
df3

                   A         B         C         D
2013-01-01  0.744068  0.707651 -1.499833 -0.065783
2013-01-02  0.056498  2.667955 -1.575088  0.905107
2013-01-03 -0.861906  2.361573  0.461547  2.285360
2013-01-04 -0.261028 -0.272507  2.476634 -1.180546
2013-01-05 -0.645866  1.099849 -0.116315 -1.513242
2013-01-06 -0.024248 -1.243800  1.396448 -1.261956